[
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in India on 28 June 2022",
        "review_text": "No doubt, 12th gen Intel processors are a marvel of computing technology. Although there is a continuing tug of war between Intel and AMD in this regard. I personally chose Intel Core i7 (12700K) with inbuilt UHD graphics for my newly built desktop PC. For those, who don't want to use a separate and usually exorbitantly priced graphics cards, this processor is a very good alternative. It can handle most of the processing intensive rendering of Blender easily with its unlocked overclocking (obviously you have to use the supporting motherboard, i.e. presently available Z690 chipset motherboards). It can also smoothly handle almost all the tasks of Adobe Lightroom and Photoshop with no hiccups. Not to mention the support of 4K video with HDR if you are looking for some decent and the latest entertainment in your PC. I would suggest this 12th Gen i7 to those who want to use their PC for content creation purpose in the best possible way and also at the same time save some money (compared to 12th Gen i9, which would ideally be the best anyway, but costlier too). The price is still at a high level. Hopefully this comes down soon with the launch of Intel's 13th Gen processors!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in India on 29 March 2022",
        "review_text": "I have paired this processor with Asus Prime Z690A motherboard and 32G 5200Mhz DDR5 ram. My usage is mostly for Adobe suite for 4K video rendering & photoediting (without dedicated eGPU) and ocassonal AAA title gaming like GTA5, Battlefield, Cpunk,etc.\nThe processor works like a charm for rendering and Games upto 75Hz in 1080p ultra setting.\nOverall good processor for the price and more review to come in future edits.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 13 February 2024",
        "review_text": "Processore eccellente, montato sul pc perfettamente senza intoppi, regge benissimo i giochi semplici anche senza scheda video",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Australia on 2 April 2024",
        "review_text": "Working well, stable and can be overclock - with correct cooling setup. Good price too.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 23 May 2024",
        "review_text": "Does exactly what it's supposed to do, my computer works great",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Singapore on 29 December 2023",
        "review_text": "Good value purchase to build a system.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 10 April 2024",
        "review_text": "So, being an AMD fanboy, I was not keen on getting this, but the c/t (cores to threads) kinda caught my eye. Running 12 cores, and 20 threads (4 e-cores i think) I thought, well, for the price, it should be okay?\nI was wrong...\nThis cpu is a monster in my eyes. Running with 32GB of ram (ddr4) and matched with the RTX 4070 GPU being cooled by the Artic Liquid Freezer ii, there is nothing stopping this from performing to its max. I would recommend this piece of kit to anyone, starting out or continuing on with building computers for their \"high end\" gaming etc. I have not once seen this struggle.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 23 August 2023",
        "review_text": "Es lo que se espera de sus especificaciones.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 5 May 2023",
        "review_text": "Al momento de comprarlo tenía duda sobre si me llegaría muy maltratado, ya que es importado de Amazon USA, pero venía en excelente estado, cumplieron con el tiempo de entrega y no tuve absolutamente ningún problema en el envío ni en la entrega, además de que está a un precio más bajo que el resto. Lo recomiendo ampliamente, sobre todo para las personas como yo que están armando su primer PC Gamer y de trabajo y buscan pieza por pieza.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Brazil on 10 July 2023",
        "review_text": "É muito rápido, mas esquenta bastante, chega a usar 220W em teste de estresse. Antes de comprar, procure saber nos fóruns sobre essa questão, não importa qual cooler e pasta térmica use, ele vai esquentar muito. A única solução é fazer um ligeiro undervolt, ou diminuir o loadline calibration na BIOS. Me fez lembrar o i7-7700K que sofria do mesmo problema.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 13 February 2024",
        "review_text": "Comme d'hab chez Intel c'est très bon, les perfs sont juste incroyable avec le boost natif, j'ai réussi a l'OC jusqu'à 5.2Ghz et je suis sur qu'on peut monter encore avec un water custom.\nSeul défaut c'est que très vite quand on prend une 4080 il tire un peu la langue en 4k. Je vais devoir le changer après 2 ans à cause de bottleneck, mais sur une config avec une 3080(ti) ça doit être une très belle synergie.\nTrès bon sur les tâches processeurs aussi, pour l'utiliser pour faire un peu de rendu les perfs sont vraiment bonnes.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 17 June 2024",
        "review_text": "私にはハイスペすぎました。",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 25 February 2022",
        "review_text": "I upgraded to this CPU after some HEAVY research, asking Reddit (Both Intel and AMD subreddits), weighing in money VS performance gained. I have used AMD since I was a teen and started building computers. The conclusion is this: It is an amazing CPU, runs faster and cooler than my Ryzen 7 1700. The price AND performance VS AMD (Also including a board) was better than if I had went with a Ryzen 7 5800X.\n\nSome background information: I wanted to upgrade after receiving an Amazon gift card (I have never ordered computer parts from Amazon though). I upgraded from a Ryzen 7 1700, with an ASUS x370-f board. I really wanted to upgrade, and was sad also that Windows 11 did not support my CPU! I will give it to Microsoft for this, as it made A LOT of people upgrade their entire computers, all for basically the same OS as of now with newer looks, and not much done under the hood (EXCEPT for 12th gen Intel, so good news there too). Sadly, my old board STILL doesn't support the Ryzen 7 5000 series, and only the 3000 series (They are working on a BIOS apparently for the 5000 series, because of people who were in my shoes). I first almost ordered the Ryzen 7 3800XT, for $400! After a couple hours of research, asking, and thinking about it... I cancelled that order (Thankfully) and thought \"Well, if I am going to spend this much on upgrading my CPU, I might as well go all in/spend a little more for something better, as this may be my last big upgrade in this regard for awhile.\" I was then going to get the Ryzen 7 5800X with an Asus board. There lied a problem of price, I could not find a board AND get that CPU still within my budget (At-least not a board that wasn't worse than the one I had in ways). I mentioned I had posted on the AMD subreddit, and even they suggested I go Intel (Intel is just killing it as of now, hands down, although I am sure AMD will retaliate). I ended up getting the MSI Z690-A DDR4 (I wish I had the money for DDR5 RAM, I would have went with the DDR5 version as it was basically the same price). I had A LOT of second thoughts on this board though, as it just didn't seem \"Premium\" as the one I had (I am going to do a whole review on it after this. I'll save my Pros & Cons for there.) This CPU also auto-clocks itself up or down depending on the load (Saw it clock down to 1GHz, although not for long, for example if not much processing power is warranted, which makes sense and I wish everything did). So if idling, it will clock down and save power/heat/and therefore longevity is increased. I absolutely love this CPU coming from AMD. Anyways...\n\nIf you have a Corsair H100I RGB Platinum or similar cooler already: The included 1200 screws work just fine with the 1700 socket and this CPU, even though you are supposed to get the 1700 kit/screws for this CPU (Which I did, but they are taking FOREVER to ship, so I googled, and someone said using the 1200 screws will work just fine). I get better temps. than my Ryzen 7 1700. I can even overclock EVEN MORE but have no need, and no point.\n\nTL:DR\nUpgraded from: Ryzen 7 1700, Asus Rog Strix x370-f gaming.\nUpgraded to: i7-12700K, MSI Z690-A DDR4.\nParts kept: 4x8GB 32GB DDR4 CL16 3000MHz RAM (With XMP, D.O.C.P), RTX 2070. The RAM works great with this CPU as well, although it TECHNICALLY (Latency wise, runs at 2T on Intel instead of 1T on AMD) runs slower than when on AMD (AMD's infinity fabric) but obviously whatever Intel is doing makes up for that, and therefore my RAM either runs faster/the same)\n\nPros: It is an amazing CPU for price VS performance. The i5-12600K is good as well (I almost just went with it), and you would be fine going with it for gaming (As even it still has more cores technically than the Ryzen 7 5800X, it also beats the 5800X even though THIS CPU is supposed to be its comparison rival brother.) This CPU has cool temps on my Corsair H100I RGB Platinum cooler, and the P&E core structure are REALLY cool and fun to watch when doing tasks/gaming. It shipped fast!\n\nCons: Literally none with the CPU itself. Just with shipping - It shipped really fast! Was here in 2-3 days after purchasing on here. The biggest complaint I have is Amazon's shipping (SO BE AWARE OF THIS) I have never ordered computer parts from Amazon, and have always used New-egg. They just left the CPU in my mail-box, and if it weren't for me looking at my camera's, and looking out for this part, it would have sat in the mail-box all day. My mail-box sadly is not very weather proof as well, and if it had been raining... It wouldn't have been good. Although it did come in a big box around it. The CPU also was jarred loose and flopping around in the box (Not held into the front window).\n\nI hope this review helps people!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 2 February 2024",
        "review_text": "Alles gut so",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 18 January 2024",
        "review_text": "Excellent cpu and great value",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 25 May 2023",
        "review_text": "自分のCPUが結構古いので、12年ぶりにアップグレードしました。\n最初はRYZENに迷っていたが、結果これを購入することにしました。\n\n結果はすごく満足で、\n友達の似たようなのRYZENのCPUと同じゲーム実行してみた結果、\n自分のPCの方が勝っています！！（笑）",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 18 October 2023",
        "review_text": "LLEGO EN PERFECTAS CONDICIONES, MUY RECOMENDABLE",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Australia on 28 December 2023",
        "review_text": "Basic processor used from my home PC, does exactly what was requested and ordered",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Singapore on 19 December 2023",
        "review_text": "Big upgrade from my 9 years old 5820K.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 12 June 2024",
        "review_text": "Great CPU, put it in a new personal gaming rig and it hits 5.3ghz out of the box no tweaking and runs stable as can be. Very happy.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 18 January 2024",
        "review_text": "For my needs, it’s the perfect “bang for the buck” balance between performance and price.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 26 October 2023",
        "review_text": "Classica CPU Intel di fascia media da gaming e produttività. Packaging perfetto e nessun problema di installazione.\nViste le ultime uscite di CPU intel di 14^ generazione il prezzo dovrebbe assestarsi intorno ai 280-300 € per diventare un best buy",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 17 January 2024",
        "review_text": "Livraison relativement rapide et processeur livré neuf",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 11 September 2022",
        "review_text": "Guter Prozessor, kostet aber auch sein Geld. Verursacht bei mir teilweise Spulenfiepen, ansonsten ein gutes Produkt.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 2 January 2023",
        "review_text": "If you're not going next gen, this is your best option, great price and amazing performance both in gaming and productivity",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 11 August 2022",
        "review_text": "Ich verstehe halt nicht warum ich einen kaputten CPU geschickt bekomme das ist halt einfach nur unnötig und zeitaufwendig",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 29 May 2024",
        "review_text": "performent",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 2 May 2023",
        "review_text": "Tutto Ok",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 14 July 2023",
        "review_text": "Intel CPU is good",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 26 July 2023",
        "review_text": "Funciona perfectamente. Noto la diferencia ya que vengo de una i5 octava generacion. Y ya con una GPU 4070 ti tendré mas experiencia al respecto.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 24 January 2024",
        "review_text": "This is my first intel build coming from past AMD builds (Ryzen, FX, Athlon, Phenom). I am nowhere near a hardware engineer level to distinguish or feel the differences in performances but for the average gamer and turning on this CPU with instructions followed, this chip is very well to be worth it and confident to be future proof until at least 2026. I overclocked this via the motherboard/bios settings and it stays cool with a $30 fan cooler. (don't get a super cheap or small cpu cooler otherwise would risk overheating) Just follow installation instructions carefully the chip is delicate. windows experience rating is a 9.7 so that says it all. If you have the extra 50-60$ go with the i9 i should have done that. AMD seems to be all the hype but I see why Intel won't be going away anytime soon this is a solid chip.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Australia on 19 August 2023",
        "review_text": "Good.......",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 25 September 2023",
        "review_text": "Rien à redire et il ne chauffe pas (28C au repos) même sans water cooling",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 2 May 2024",
        "review_text": "Supérieur au i5 13500 de 15%",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 4 August 2022",
        "review_text": "新品のマザーボードにとりつけて起動したら、マザーボードのLEDのCPUのところに赤ランプが？\n壊れているの？",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 5 May 2023",
        "review_text": "Un procesador rápido y eficiente, en conjunto con una buena tarjeta grafica, es una maravilla",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 5 May 2023",
        "review_text": "super",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Australia on 22 December 2021",
        "review_text": "Fast and nice. Good shopping experience for me.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 11 June 2023",
        "review_text": "Fait parfaitement son taff",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 17 May 2024",
        "review_text": "Got it as an upgrade over my old 8700k and this is a huge upgrade. I do recommend installing a contact frame such as the thermalright for this CPU",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 4 September 2023",
        "review_text": "This is my first 1700 socket processor, so I can't really give it a proper speed review , however it was very simple to install , just be very very careful !!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 17 March 2023",
        "review_text": "Arrivé dans les temps et le produit est très performant l’un des meilleurs processeur du moment parfait pour les jeux d’aujourd’hui qui sont souvent cpu-bound !",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 21 December 2022",
        "review_text": "Un muy buen producto. Lo ocupo para desarrollo de software y la verdad es muy rapida la computadora, aun cuando ocupo docker.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 10 April 2024",
        "review_text": "I heard good things about this cpu and went for it. Budget friendly and a very good cpu!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 3 January 2022",
        "review_text": "Finalmente un bel passo avanti da parte di Intel. Il processore va davvero bene, parco nei consumi, potente sia in single che in multi core e non scalda eccessivamente.\nSe lo state guardando qua probabilmente avrete già visto innumerevoli benchmark sul web quindi inutile postarli.\nCome tutti i componenti di un pc va contestualizzato rispetto all’uso che una persona ne deve fare. Personalmente ne consiglio l’acquisto",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 6 October 2022",
        "review_text": "No comento",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 17 March 2023",
        "review_text": "Venditore serio e consigliato",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 5 February 2022",
        "review_text": "je quitte un i7 6700k (6eme gén) qui avait fait son taf pour le nouveau i7 12700k et la c'est le jour et la nuit.\ncouplé à une CM ASUS ROG STRIX Z690 et au refroidissement ROG RYUJIN II 360.\nil répond à mes attentes, j'ai hésité entre le i5 12600k et celui ci, je ne regrette pas mon achat.\ncoté AMAZON, rien a dire commandé le mardi pour une réception 48h après, le jeudi.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 23 May 2024",
        "review_text": "Exactly what I needed",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 22 September 2023",
        "review_text": "I upgraded from the i7 6700k to the i3 13100 and saw a great performance increase. I was eager to test ddr5. However, I also wanted to experiment with 6+ core processors. Fortunately I found this i7 12700k when the price dropped to 275. I wasn't sure if it would be a big increase from the i3 and the i7 6700k. But the i7 12700k is a ferocious beast that has crushed all tasks I've given it and brought immesnse life back to my RTX 2060 super and it stays cools & fluent.\n\nZ790 auros elite ax\nI7 12700k overclocked pcores 5.2 ghz ecores 4.0 ghz 50-65°C during multi intensive tasks and games for long periods of time\nRTX 2060 super 8bg ddr6\nCorsair vengeance 6000mhz ddr5\n\nCyberpunk 60-65 fps 1080 ultra+psycho with medium ray tracing with a low of 59\nStarfield 30- 40 1080p fps high settings the devs need to optimize though\nHorizon zero Dawn 80-85 fps 1080 ultra\n\nShreds through video editing and music editing all at once\nAmazing at multitasking\nPowerful\nFast\nCan be placed in ddr4 mobos and ddr5 mobos",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 3 February 2024",
        "review_text": "got it the next day as stated and was exactly as advertised. Yes would buy from again",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 8 April 2024",
        "review_text": "ya e cambiado todos los componentes de mi pc y desde que compré el procesador me llego con fallos no e podido escribir por que e estado muy ocupado",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 4 October 2023",
        "review_text": "Il processore è ottimo, uso il pc per streaming e gaming e fa il suo dovere senza problemi. Però quando l’ho comprato era salito fin troppo di prezzo rispetto agli altri processori e alla qualità-prezzo. Funziona benissimo al momento, in uso da un mese.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in France on 16 August 2022",
        "review_text": "Ça marche bien, avec assez de coeurs et de lanes pour s'amuser sur des machines virtuelles, mais moi qui garde mon ordinateur constemment allumé (inactif, mais avec chrome ouvert et une trentaine d'onglets dont certains s'actualisent tout seuls), j'ai bien augmenté ma conso par rapport à mon 7700K précédent.\n\nLe turbo à un peu plus de 5Ghz c'est rigolo, mais ça double la conso et donc le température. Ça marche bien mais ça chauffe sévère quand ça active le turbo, et si on tente de ventiler correctement la moindre pointe s'entend !",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 9 January 2024",
        "review_text": "Just be sure to match up the chip correctly on the socket (one corner has a triangle cutout)\nEasy to install.\nRuns smooth and is not a power hog or a supernova in terms of heat.\nEven at load, it performs well.\n\nPerfect for gaming, no issues in keeping up with GPU.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 22 June 2022",
        "review_text": "Prodotto di grande qualità, pianificato l'acquisto per la configurazione di un nuovo pc. Molto soddisfatto su acquisto e tempi di consegna",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 6 February 2022",
        "review_text": "Pas de problème au montage : j'ai monté un ventirad noctua NHU12A : quand le proc travaille à 100%, il reste sous les 80°C. En fonctionnement normal, l'ensemble est silencieux. Attention si la CM marche à la DDR5 : c'est 2 fois le prix de la DDR5.\nLe GPU fonctionne bien (traitement video) en attendant que les cartes graphiques reviennent à des prix raisonnables.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 3 March 2024",
        "review_text": "A great performance, cheap enough for the performance it gives. I got this for 210$ on BF. Recommend!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 6 February 2024",
        "review_text": "Good enough for this price range",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 4 June 2024",
        "review_text": "Para mí el mejor de las última tres generaciones de Intel, un TDP decente, no eh tenido problemas de temperaturas ni ningún problema , lo recomiendo.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 13 May 2024",
        "review_text": "runs Microsoft Flight simulator on multiple 32\" screens beautifully.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 9 April 2024",
        "review_text": "Perfect",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 17 February 2024",
        "review_text": "Great product/Brand Intel i7 CPU. I have been using the Intel brand CPU's and have been using the i7 and the K series since they were introduced. This seems to handle video processing and CAD/CAM projects quite well. I have always had great luck with Intel brand processors and will continue using them. Pretty good value for the cost.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 4 December 2023",
        "review_text": "Compared to the Coffee Lake generation I had been (willingly) stuck on for 4 years this is a massive leap. Before buying I was a bit skeptical since I'm not a fan of Intel's newer way of handling cores, but the first thing I tried when I got it was emulating PS3 games and right off the bat I saw compile times cut tenfold and stability at least doubled.\n\nThe older CPUs from the 8th, 9th, and 10th gen are perfectly usable for most people so if you're on a budget maybe look on the used market for those. But if you really need something powerful this is a good option.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 August 2023",
        "review_text": "This item has been with me for a very short time.\n\nSo I recently decided to upgrade my gaming rig, and after extensive research, I made the bold choice to order the Intel Core i7-12700K Gaming Desktop Processor with Integrated Graphics and 12 Cores. Let me tell you, this processor is the absolute best! With its 12 cores, it brings a whole new level of performance to my gaming experience. Whether I'm playing graphically demanding AAA titles or indulging in intense multitasking, this processor effortlessly handles it all. And what's even better is that it comes with integrated graphics, meaning I didn't have to shell out extra cash for a separate graphics card, yet. The integrated Graphics offer the flexibility of running dual displays smoothly without any hiccups. Plus, with Intel's reputation for reliable and high-quality products, I know I can trust the i7-12700K to last me for years to come.\n\nI hope you find this review helpful.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 15 March 2024",
        "review_text": "Huge upgrade from 8th gen i5! paired it with the ASRock Z690 and 32g DDR4",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 December 2023",
        "review_text": "The morning after building and setting up windows, drivers, etc. The PC had blue screened because of temperatures, and after a reset and entering the BIOS I saw that the temperature was 89 degrees celsius. Thankfully, after some trial and error I was able to undervolt it and not have my CPU die. I'd suggest anyone who looks into getting an intel CPU to undervolt it!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 12 January 2024",
        "review_text": "the one i bought one year ago had instability. didn't know it was the CPU until it really started acting up. had to do a lot of tests with different component to finally be able to pinpoint the CPU. When i reached out to Intel, they Informed me about a policy about ''tray'' processor and ''boxed'' processor. basically a tray processor is sold in bulk and they don't cover warranty. As for Boxed processor, they are sold by certain compagny and cost usually more. Fortunatly, the one i got was a boxed one, but still Intel told me i had a ''tray'' processor. i had to go on their website and enter my product information and send them the proof that their website is saying i have a ''box'' processor. It was a bit unnerving, but at the en, they offered me the warranty and i'm supposed to receive a new one when they finish processing the one i sent them.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 19 March 2024",
        "review_text": "Usado no trabalho.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 10 December 2023",
        "review_text": "At this time in the product life cycle, the 12th gen CPU is about half the cost of the 14th gen CPU. It is more than fast enough for everything I do. My major reason for upgrading was my old motherboard did not have TPM 2.0. The CPU was easy to install, it is running between 36-37 degrees Celsius (though I admit I am not stressing it). I am very happy with my purchase.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 February 2024",
        "review_text": "Recibí el producto con la prontitud del caso. Llego sellado y en una caja con otro producto. El funcionamiento es bueno y no se suele calentar mucho con un buen sistema de refrigeración por aire.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 25 February 2024",
        "review_text": "This appears to be the best option for intel at this price range. Works as advertised.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 30 January 2024",
        "review_text": "This is a very good product, and there are no issues with its features and performance. The usage process is also very smooth, and there hasn't been any overheating so far.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 29 January 2024",
        "review_text": "我特價時購買的，使用上沒有任何的問題，物超所值。\n\nI purchased it at a special price, and I haven't encountered any issues in terms of usage. It offers great value for the money.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 February 2024",
        "review_text": "It's a top-of-the-line CPU that will last for a long time. There's nothing to dislike about it.\nit replaced a 12 year 3770K!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 16 January 2024",
        "review_text": "If you're looking for an Intel cpu I would recommend this even though it is a couple years old now I belive its still the best intel cpu for gaming",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 25 February 2024",
        "review_text": "Play Video\nYa vere como se comporta cuando haga mi ensamble",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 24 January 2024",
        "review_text": "Went from a 9400f to this was a big different on gaming, i finally get the fully potencial of my gpu",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 March 2024",
        "review_text": "Excelente",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 19 February 2024",
        "review_text": "Great cpu, would buy again.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 1 December 2023",
        "review_text": "Wow what an incredible black Friday deal. Seriously, $211 is well worth it for the performance. I also purchased the 12600k for $153 which is another unbeatable deal offered this year at amazon. If you managed to get your hands on either one of you made the right choice.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 18 January 2024",
        "review_text": "This is a second purchase of core i7 12700. It works very well as expected.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 30 November 2023",
        "review_text": "for my limited budget, I bought it, While the 12700K isn't the top of the line, at least for me, it was more affordable and very performant. I've had good success overclocking it and actually undervolting it to reduce temperatures!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 28 December 2023",
        "review_text": "I've installed a 10th gen 2x, 12th gen, and a 13th gen on my family's pc's. I've never had a problem.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 5 August 2023",
        "review_text": "It's pretty good value for money (as far as intel CPUs are concerned...) for a 12th gen CPU, but if you're looking for the BETTER value get the i5-13600K which outperforms it at pretty much the same cost while being a 13th gen CPU. The only real downside of the 13600k is that it generally requires a 13th gen compatible motherboard, otherwise you'll need to FLASH THE BIOS on a 12th gen compatible motherboard to update the motherboard for it to be able to read 13th gen CPU (I highly do not recommend doing this). I've tried it a few and it's such a big hassle (many potential issues...)that I recommend first time PC builders or part buyers to just save yourself a headache and buy a 13th gen CPU, along with a 13th gen compatible motherboard (don't buy 12th gen mobo) which obviously doesn't require flashing bios for the 13600k to be usable.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 January 2024",
        "review_text": "Great CPU for multitasking, I don't know too much about CPU but this is great!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 21 July 2023",
        "review_text": "So far so good, but then that's what I said about the last one... I'll check back in a year on this and hope it outlasts my prior CPU.\n\nAs for the last one... it's Intel dropping the ball with their QC it seems. Had an IMC function poorly and finally give up the ghost and refuse to post with more than one memory module installed. Couldn't run any XMP profiles, and swapping the processor solved it (not a Mobo issue).\n\nJust watch for funky behavior when you buy this gen, and return it if *anything* seems even *remotely* off.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 25 July 2023",
        "review_text": "The heart of my PC build and wanted to have the \"K\" version with the Integrated Graphics... even though I was going to have a GPU anyways, it's a good backup if the GPU fails.\n\nCan't do a Pro and Con here as there is nothing much to report.\nIt plays every game without bottlenecking my RTX 3070 and was a breeze to install (there is literally one way to install it. <You'd have to intentionally or forcibly install it wrong).\nAlso, it runs surprisingly cool and doesn't act like an easy-bake oven in my Motherboard.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 16 July 2023",
        "review_text": "Not much to say about this cpu. It's Intel, and these are immortal. Still have the 3770K I got like 10 years ago, and an Extreme I got even earlier than that.\n\nSo the main motive here is to let Amazon know that I HAVE received the item, but I don't know how to let them know so they can change the \"package left at mail\" to \"Already received\"...",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 22 November 2023",
        "review_text": "I got the CPU on sale and I would say the performance is great, my application is running smoothly and does not come into any problem for a year now.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 16 November 2023",
        "review_text": "this thing is a workhorse! ive got mine clocked to 5.0GHz and it runs like a dream, keep in mind this unit will require a water pump air coolers are not enough!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 26 June 2023",
        "review_text": "Bought this K to have graphics backup. The CPU is great the graphics not so much. Still I do not use the internal graphics as primary graphics for my PC, but only for the purpose of having temporary backup when needed. So for that purpose it works. The cost vs the KF is fairly negligible so for its primary purpose it is a very good CPU.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 January 2023",
        "review_text": "The i7-12700K is in the top 5 for gaming CPUs right now. AMD is doing fairly well as of late but Intel has a solid performance lead with it's single core performance on newer generation chips.\n\nIf you're on the fence and want a quick top 5 for overall gaming performance, it goes as follows:\n1. i9-13900k\n2. i7-13700k\n3. i9-12900k\n4. i5-13600k\n5. i7-12700k\n\nThis chip is no slouch though, it trades blows with the 13600K in some situations if overclocked but overclocking isn't really fair for comparison.\n\nIn conclusion, if you're looking around this price point, check both this CPU and the 13600k. Pick whichever is cheaper. Higher end 12th gen Intel motherboards can be flashed in the BiOS to take 13th gen CPUs too, but do your research on those before going that route. This one will serve you well. :)",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 22 September 2023",
        "review_text": "Bought this for a new personal PC. My last was an i7 4790K build that got totaled out (crushed) during shipping. After building a new one on a z790i platform, the performance gain was stunning, completely night and day! I cannot say enough about this CPU, and would totally recommend this product!!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 15 February 2022",
        "review_text": "It's been roughly 6-7 years since I last build my gaming computer. Upgrading to this has been more than significant. As of this writing, I hope you've done your research the I7-12700k's price point and its competition. For this price point, it may be the top dog.\n\nSome things to consider before purchasing:\n1) Make sure you are purchasing a LGA 1700 motherboard. I went with the DDR4 motherboard because DDR5 is still at its infancy. The DDR5 ram may not be the best option for your buck right now. You'll be fine with DDR4.\n2) This CPU does consume a lot more power compared to its predecessor. Double check if your PSU will be enough. There are online resources that will help you calculate your PSU. It's always good to have a little overhead.\n3) Make sure your heatsink has retrofit screws that's compatible with this motherboard. You can purchase them separately. If you have a heatsink that's very old (<2016), it's more than likely it may not be compatible.\n\nGood luck!",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 4 August 2022",
        "review_text": "I had been planning to hold off for Raptor Lake, but my Z370 mobo died, and I decided to go ahead and get an Alder Lake i7. So far it's impressive. It runs much cooler than my i9-9900k (mild OC) ( 59C-63C under a gaming load vs 75C+) but that could've been due to the my old AIO being in it's death throws for the past few months. 3DMark CPU score went up noticeably as well. Overall, I'm pretty happy with it. Haven't messed around with overclocking yet, but there doesn't seem to be as much headroom left as there used to be, from what I've read 5.3 Ghz is about what you can expect. The days of getting another 800Mhz - 1 Ghz+ over stock clocks out of a CPU are gone it seems.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 August 2023",
        "review_text": "Recibí el procesador con el sello de seguridad roto, hasta ahora todo funciona correctamente pero no me agradó que esto estuviera así",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 9 December 2023",
        "review_text": "Great product",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 20 July 2023",
        "review_text": "Bought this for my new upgraded setup, I decided to pick this processor to replace my old i7 4790K, although it was still running strong after many years it was starting to show signs of aging so I completely went from 4th gen to 12th gen, performance in gaming and business apps is really noticeable.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    },
    {
        "product_name": "Intel Core i7-12700K Desktop Processor 12 (8P+4E) Cores up to 5.0 GHz Unlocked LGA 1700 600 Series Chipset 125W",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 24 September 2023",
        "review_text": "Paired it with an ASUS MOBO and a Lian Li 360mm AIO.\nRuns cool, no performance issues, and no bottlenecks for the gaming i use it for.",
        "product_style": "Style Name: Processor Only",
        "product_mrp": "₹60,000"
    }
]
