[
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in India on 12 June 2024",
        "review_text": "super speed enough for heavy editing. value for money. i will reccomend this. i bought for 23000 rupees before six months.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 16 September 2023",
        "review_text": "Great cpu for video editing and gaming",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Singapore on 11 December 2023",
        "review_text": "I went for this due to the energy saving comparing to K chips and for performance I didn't see much diff since I'm doing alot files backups and transferring of big files",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 18 July 2023",
        "review_text": "There is little reason to look beyond i5 CPUs for anything other than heavy workstation loads.\n\nThis CPU with 6 hyper-threaded performance cores (12 threads) plus 8 'efficiency' cores (which are pretty fast in their own right) has a total of 20 threads- it's performance is outstanding.\n\nThe best part about it is the efficiency, this is a 65W TDP part (boosts to 154W), and whilst idling is only drawing 15-18W. This makes it very easy to cool. In my small form factor case, I'm able to keep the CPU at 25°C-30°C above ambient temperature.\n\nWhilst gaming, I'm yet to see utilisation above 25%. For productivity loads, it chews through most tasks thrown at it with aplomb.\n\nIf you are wanting to overclock, the i5-13600K is the step up you need, but for everything else, this CPU is fantastic.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 3 March 2024",
        "review_text": "La cpu è ottima e viaggia molto bene anche in gaming, attenzione se avete intenzioni di overcloccare alle temperature perchè se stressato i gradi salgono, consgiliato!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 2 March 2024",
        "review_text": "Sehr sparsam und schnell",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 24 December 2023",
        "review_text": "No es un i5 cualquiera, cuenta con 14 núcleos y 20 hilos, además consume 65w, que más se puede pedir",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 25 September 2023",
        "review_text": "J'ai récemment acheté le processeur Intel Core i5-13500 et dans l'ensemble, je suis satisfait de ses performances.\n\nTout d'abord, ce processeur offre des performances solides pour les tâches quotidiennes et les jeux. Les performances monocœurs sont bonnes et la capacité multithread permet de gérer efficacement les charges de travail plus lourdes. J'ai remarqué une amélioration significative par rapport à mon ancien processeur, ce qui se traduit par une expérience plus fluide et réactive.\n\nCependant, je dois souligner que le prix de ce processeur est un peu élevé pour l'année 2023. Avec l'évolution rapide de la technologie, il est possible de trouver des processeurs offrant des performances similaires à un prix inférieur. Si vous êtes à la recherche d'un processeur économique, il peut être judicieux de considérer d'autres options sur le marché.\n\nDe plus, il est important de noter que ce processeur est basé sur l'architecture Alder Lake, qui est relativement nouvelle. Cela signifie qu'il peut y avoir des problèmes de compatibilité ou des ajustements nécessaires pour certains logiciels ou jeux plus anciens. Assurez-vous de vérifier la compatibilité avec votre configuration avant l'achat.\n\nEn conclusion, le processeur Intel Core i5-13500 offre des performances satisfaisantes pour les tâches quotidiennes et les jeux. Cependant, le prix élevé par rapport à d'autres options sur le marché et les éventuels problèmes de compatibilité peuvent être des facteurs à prendre en compte. Si vous êtes prêt à investir dans un processeur de dernière génération, celui-ci répondra à vos besoins en termes de performances, mais il peut être judicieux de considérer d'autres options si vous recherchez un meilleur rapport qualité-prix.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 2 February 2024",
        "review_text": "Play Video\nCPU ist top, ich kann mit diesem CPU mit mein RTX 4070 in alle Spiele Ultra Setting spielen.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 3 January 2024",
        "review_text": "Super ce i5 13500, pris pour remplacer un i5 9400f. C'est impressionnant. Je recommande ce processeur pour une utilisation bureautique, montage vidéo. Pour le jeu, je ne peux donner mon avis, je ne suis pas un Gamer.\nLa carte vidéo intégrée est largement suffisante pour mon utilisation. Petit conseil, utilisé un bon ventirad.\nC'est mieux de le prévoir au montage. Votre processeur vous le rendra bien.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 16 March 2023",
        "review_text": "El mejor procesador calidad de precio de la gama media. Tienes el i5-12400F que es el mejor calidad precio si quieres algo más barato. El i5-13500 (este procesador) si necesitas más potencia es el mejor calidad precio en este rango de precios, y si quieres aún algo más potente (un pelín más) está el i5-13600KF. Estos 3 son los mejores procesadores de la gama media-alta calidad precio.\nDicho esto, este i5-13500 tiene muy buenas temperaturas, con un disipador thermalright Assassin SE de 40€ siempre está a 26 grados, jugando a 30-40 grados y metiéndole mucha caña a 50-60. Cuando haces pruebas de estrés y pones el procesador al máximo durante 10 minutos, la temperatura es de 75-80 grados. Esto también depende de otros factores como la caja y la temperatura ambiente, pero en ningún caso es un procesador caliente, con 40€ refrigeras este bicho. Trae un disipador en la caja (el de intel), pero no lo recomiendo si vas a meterle caña, pues se calienta mucho, en torno a 20-30 grados más.\nLa prueba cinebench me arroja un resultado de casi 21000 puntos, situándolo justo por debajo actualmente del i7-12700 si no me equivoco, un procesador mucho más caro y que, como se puede observar, tiene prácticamente la misma potencia.\n\nConclusión: Procesador top calidad-precio. Recomiendo comprar el i5-12400F, el i5-13500 o el i5-13600kf dependiendo del presupuesto. En cualquier caso, probablemente vas a ir sobrado, yo les meto caña con motores de videojuegos y reenderizacion y funcionan muy bien.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 6 January 2024",
        "review_text": "Play Video\nYou can save on cpu cooler but later you will have to get new cooler anyway because it hits 99°C on heavy loads. Good for HTPC and SFF builds.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 23 July 2023",
        "review_text": "Processore con un rapporto qualità prezzo che sfiora l'Olimpo: una bestia che trita qualsiasi applicazione o gioco o lavoro che gli date.\nAnche come temperature ci siamo (se si attivano nel bios gli E-CORE comincia a scaldare... anche se utilizzando in dissipatore a torre con due ventole non ho mai superato gli 85 gradi, nemmeno in questa estate afosa).\nAttenzione a settare bene il BIOS per questa bestia, vi scrivo qualche accorgimento da avere per evitare problemi: 1) attenzione al profilo di potenza della CPU, se lasciate così comè avrete un PL1 di 115w e un PL2 di 254w (dipende dal produttore della scheda madre, ma bene o male i valori sono questi), il processore così scalderà parecchio... io ho settato il profilo di INTEL (lo trovate tra quelli disponibili nel bios), così ho PL1 65w e PL2 154w e testando ho scoperto di non aver perso prestazioni in alcun modo (al massimo 2/3fps in meno ma dormo la notte lo stesso).\n2) SE AVETE GPU AMD: per attivare il RESIZABLE BAR nel bios dovete prima abilitare la voce ''above 4g decoding'', riavviare il pc sempre accedendo al bios e poi attivare il ''resizable bar''... se non lo fate può succedere che la scheda non riesca ad applicare in contemporanea le modifiche di queste due variabili e sarete bloccati in un BOOTLOOP (per uscirne basta resettare il bios facendo fare corto circuito ai due pin sulla scheda madre).\n\nPer il resto ottima CPU sono molto soddisfatto.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 15 May 2023",
        "review_text": "Bättre prestanda än den dyrare 12600k och ligger inte så långt efter 13600k. En trevlig CPU som täcker mina behov och presterar bättre än mig gamla i7 8700k.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 22 June 2023",
        "review_text": "Works great with rtx3070 and 3000 mh",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 11 December 2023",
        "review_text": "Der i5 reicht für fast alles vllig aus. Top Leistung zu dem Preis. Reicht auch für Gaming",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 29 October 2023",
        "review_text": "Passei de um i5 9400f, tao melhor, parece estranho visto que era um 9th gen intel, mas este funciona muito bem especialemente em conjunto com a rtx 3050 (mas iria recomendar uma 3060 ou 4060).",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 9 February 2024",
        "review_text": "It is fast enough for a good gaming experience. I use 1440p with no problems",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 2 February 2024",
        "review_text": "Pour mon premier pc j'ai choisi ce processeur réputé pour offrir un confort de travail et c'est le cas ! Il consomme rien et chauffe très peu. Il a écrasé mon Mac Mini M1 tellement facilement!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 15 May 2024",
        "review_text": "Velocissima CPU ottima x il gaming e scada pochissimo . Consigliato chi vuole un CPU che non costi tanto !",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 30 January 2023",
        "review_text": "Best value cpu nothing else below 13500 in raptor lake series even comes close. Both 13100, and 13400 are truly awful overpriced value at the moment of writing this.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 16 November 2023",
        "review_text": "The Intel Core i5-13500 is a promising addition to Intel's lineup, offering a significant leap in performance and efficiency compared to its predecessors. Boasting an improved architecture and advanced technology, this processor is tailored for mainstream users seeking a balance between power and affordability.\n\nPerformance-wise, the i5-13500 demonstrates commendable speed and responsiveness in handling everyday tasks. With its increased core count and upgraded architecture, multitasking feels smoother and more efficient. Whether it's browsing the web, streaming content, or running office applications, this processor handles these tasks effortlessly.\n\nGaming performance on the i5-13500 is notably improved, offering respectable frame rates in most modern games. While it may not match the prowess of higher-end processors in demanding gaming scenarios, it provides a solid gaming experience for the price, especially when paired with a capable GPU.\n\nOne of the standout features of the i5-13500 is its improved power efficiency. The processor's optimized architecture ensures better thermal performance and lower power consumption, contributing to a cooler and more energy-efficient system.\n\nFurthermore, the i5-13500's compatibility with the latest hardware technologies ensures future-proofing and offers room for system upgrades. Its integration with DDR5 memory and support for PCIe Gen 5 are welcome additions for users looking to build or upgrade their systems for longevity.\n\nIn conclusion, the Intel Core i5-13500 impresses with its commendable performance, enhanced power efficiency, and future-ready features. While not aimed at power users or enthusiasts, this processor stands as a solid choice for mainstream users, offering a well-balanced blend of performance and value for everyday computing tasks and moderate gaming needs.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in France on 23 September 2023",
        "review_text": "Carton manque de protection, seul reproche",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 5 April 2024",
        "review_text": "Ottimo processore, non sono certo io a scoprirlo. MA per quasi 300 euro il cooler fornito è inadeguato. A pieno carico si passano i 90 gradi con relativo throttling e quindi si perde in performance.\nConsiglio di abbinare il processore a un dissipatore serio (io ho preso un Thermalright 120 SE ad aria). Che significa mettere in conto 30-40 euro in più per una cosa che doveva essere decentemente fornita insieme alla CPU.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United Kingdom on 9 July 2023",
        "review_text": "This was a replacement for an old Intel 4430, which I thought was fast when I first used it years ago. This is much quicker and has allowed me to load Windows 11.\nI'm not used to such speed.\nObviously there are much quicker CPUs available, but I don't do much processor intensive stuff, so this one is more than sufficient.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 29 March 2023",
        "review_text": "Antes de nada, no soy un experto en medir rendimiento y demás pero el salto de velocidad y rendimiento en el día a día (soy diseñador y tiro mucho de photoshop/premiere/after) con mi anterior i7 8700 ha sido brutal. No se calienta ( con el mismo ventilados/disipador cooler master que tenía para el i7), estando en 50-65 de tope a carga maxima.\nSi, como yo, te estabas pensando este o un i7 de anterior generación, no lo dudes, te ahorras un dinero y el rendimiento está genial!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 21 May 2023",
        "review_text": "Inte en enda omstart, kvalitet",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 20 August 2023",
        "review_text": "Eine sehr gute CPU für einen Mittelklasse Allround PC. Sehr effizient und sparsam aber trotzdem leistungsstark...",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 18 January 2024",
        "review_text": "Allora dovevo fare un upgrade al mio PC vecchio di 8 anni anche se top di gamma visto che montava un i7 6850k e una scheda madre MSI GAMING PRO CARBON ARGB, così non avendo un budget elevato ho prima optato per un ryzen 5800x ma ho fatto ben 2 resi sia di cpu sia di scheda madre in quanto AMD NON GARANTISCE la stabilità delle sue CPU e BIOS in generale ( confermato anche da tante persone che le cpu amd o si fondono o non partono dopo aver aggiornato il bios) così ho optato per questo i5 13500 e devo dire che è fantastico per il prezzo che ha!!!! A differenza del 5800x è partito al primo avvio con scheda madre MSI pro Z790-P WIFI. BIOS aggiornato e via con il gaming in 2k o QWHD!!!! AMAZON SEMPRE PRECISA E SERIA SIA NELLE CONSEGNE SIA NEI RESI!!!!!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 4 March 2024",
        "review_text": "Très bon produit de milieu de gamme, parfait pour stream et jouer en même temps.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 23 March 2023",
        "review_text": "Excelente para cualquier tarea. Recomendable comprar por menos de 260€",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 7 January 2024",
        "review_text": "Processore di 13a generazione,scalda poco e nonostante le altre frequenze consuma poca energia.\nNon ha il moltiplicatore sbloccato,ma a me non interessa, è molto efficiente per i due tipi di processori all' interno chiamati,Economy e Power. Compatibile con PCi Express 5\nNon delude le aspettative !!!!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 17 August 2023",
        "review_text": "I bought this processor with a motherboard a few weeks ago. The processor is doing as expected but I removed a star for the bad packaging. Still recommend the processor at 100% !",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Sweden on 19 May 2023",
        "review_text": "Bra pris och snabb leverans",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in Spain on 3 February 2023",
        "review_text": "Todos los cores a máximos procesos solo abriendo el navegador, microcongelaciones y tirones muy importantes en juegos con cualquier gráfica, 1060 y 3070. Temperaturas de hasta 84° con un disipador de 6 tubos de cobre (seguro que con el de stock se apaga) no le eches multitarea porque se sobrecalienta una burrada. Más cores no siempre es mejor. Los Ecores son más problemáticos que potenciosos. Si buscas generación 13 desde luego este no es el correcto.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 22 May 2024",
        "review_text": "Tant de cœurs dans un si petit processeur ! 6 P-Core avec Hyperthread ce qui fait 12 coeurs virtuels puissants, et 8 coeurs économiques. Par contre avec le ventirad d'origine on arrive très vite aux 100°C et donc à la limitation du CPU, c'est pourquoi je vous conseille un bon gros ventirad performant si vous voulez tirer pleinement partie des capacités de ce processeur.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 2 March 2024",
        "review_text": "Alles bestens, gerne wieder!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 8 June 2023",
        "review_text": "La compilation parallèle est rapide, fonctionne très bien dans une carte mère B660. Attention, achetez une carte mère B660 avec CPU-less firmware update, par exemple Gigabyte Q-flash. Vous devez probablement mettre à jour le firmware avant d'installer le CPU. Gère 128 Go de RAM. Achetez un refroidisseur d'air tour bon marché. Était 11% plus rapide pour moi avec un refroidissement approprié par rapport au refroidisseur Intel. Probablement durera plus longtemps aussi.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 16 January 2024",
        "review_text": "Ho scelto questo precessore per le prestazioni offerte e per il rapporto qualità-prezzo che penso sia uno dei migliori, non ho trovato problematiche di spessore e sono soddisfatto dell'acquisto.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 5 February 2024",
        "review_text": "Trovato con un offerta ad un prezzo perfetto per quello che offre.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 17 October 2023",
        "review_text": "Sans perte de performance avec une conso moindre ,je recommande, ne pas négliger la carte mere ! Acheter du bon !",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 31 October 2023",
        "review_text": "Für den Preis geht das Okay",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 3 April 2024",
        "review_text": "Intel una garanza, consigliato.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 25 December 2023",
        "review_text": "Ottimo davvero se acquistato a 250 euro e non a 280 come l ho preso io. Nella mia configurazione è abbinato ad una 7800 xt e asus h770 tuf gaming pro wi-fi con ram 32 GB ddr5 6000mhz (che però questo processore non riesce a gestire oltre 4800MT e quindi non andranno oltre 4800mhz). In giochi come cyberpunk in 4k arriva ad essere utilizzato al 70/80 % quindi direi che fa il suo lavoro alla grande! Come temp arriva sui 60gradi accoppiato ad un aio con tdw da 500w.\nEdit e aggiungo:\nIn altri giochi cpu consuming come battlefield 2042 e star citizen e sopratutto in questo inizia a faticare, facendo un leggero collo di bottiglia soprattuto sul 4k dove inizia a lavorare al 100%…\nSto iniziando a pensare se passare ad un modello più performante…",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 27 February 2024",
        "review_text": "ottimo compromesso pagato poco più del 13400 arrivato con dissipatore che non uso avendo quello a liquido",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in France on 6 January 2024",
        "review_text": "Pour du gaming 4k, de l'applicatif léger et du multimédia, il est limite un peu too much lol. Donc pour mon utilisation j'en suis très satisfait. Pour de l'applicatif plus lourd je ne saurai dire. Petit bémol peut être pour le prix qui selon moi devrait plus être autour des 230€.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "3.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 13 December 2023",
        "review_text": "Allora l' Intel i5 13500 di per sè 5 stelle. Sono costretto a mettere 3 stelle per il dissipatore stock che ne vale 1. Una cosa abbastanza vergognosa. Non tanto per il rumore che sotto carico è comunque fastidioso.\nMa ho fatto uno stress test. Ho provato applicazioni pesanti per la cpu. Stesso risultato: la temperatura andava comodamente sui 100°C e oltre.\nAnche il montaggio del cooler una cosa da doversi confessare. Sempre stato abbastanza semplice con questi dissipatori intel ma questo qui non so non entravano bene i pistoncini, una volta entrati non agganciavano, non si capisce il verso dei 4 piedini. Insomma una cosa invereconda. Davvero improponibile.\nHo preso al volo un Noctua neanche troppo costoso. Risultato cpu sotto stress massimo a 73°C. Temperatura ora mentre scrivo 27°. La salute del processore. PC silenzioso al massimo nonostante 8 ventole totali.\n\nOvvio che richiede un po' di tempo montare un dissipatore decente per cui intel preferisce evidentemente fornire un prodotto che si assembla rapidamente e non occupa spazio.\nPerò così si esagera perché quelle temperature non fanno bene al prodotto che è veramente un prodigio della tecnologia umana.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 14 February 2024",
        "review_text": "A mio parere prodotto, moto buono\nnessun problema\nveloce\nsoddisfatto dell'articolo",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 25 January 2024",
        "review_text": "I5 di 13 generazione LGA 1700 ottimo qualità prezzo eccellente",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 2 June 2023",
        "review_text": "Mi sono assemblato un nuovo pc dopo molti anni dall'ultimo. Purtroppo ho constatato che il costo delle componenti, ad oggi, è decisamente più alto e per problemi di budget qualche compromesso lo si deve fare.\nFin ora mi ero sempre affidato a CPU Intel i7 utilizzando molti software di modellazione 3D, rendering e grafica.\nHo deciso di acquistare una CPU dell'attuale generazione (13esima) ma con un tetto di spesa di 300€ per non penalizzare le altre componentistiche; la scelta è forzatamente ricaduta sulla serie i5.\nConsiderando le caratteristiche del primo i7 disponibile per economicità si nota che la differenza di prezzo (+150€) rispetto a questo i5 13500 non è poi così giustificato, quest'ultimo ha certamente il migliore rapporto prezzo/performance.\nInutile dire che questa cpu, nell'utilizzo quotidiano di tipo ufficio, è una scheggia e non si noterebbe nemmeno la differenza con un i7.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 11 January 2024",
        "review_text": "Anche con giochi o programmi pesanti va come un treno. mai un tentennamento. Scalda poco. Ottimo",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 13 January 2024",
        "review_text": "Una bomba, tranne il dissipatore stock.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 24 November 2023",
        "review_text": "This processor is worth the money. No high grades, just high FPS.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 2 October 2023",
        "review_text": "Ottimo processore, se il prezzo scende è un' ottimo acquisto.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in France on 24 September 2023",
        "review_text": "Bon Processeur, je l'ai monté dans une configuration gaming, il est suffisant, ne chauffe pas. Pour le prix auquel je l'ai eu je suis satisfait.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 7 December 2023",
        "review_text": "A detta del tecnico che me lo ha installato, tutto perfetto",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 22 November 2023",
        "review_text": "Facilmente montabile sulla scheda madre,performante anche per giochi,un po caro",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 27 July 2023",
        "review_text": "W tej cenie jest to bardzo dobra propozycja ze względu na stosunek ceny do jakości. Dodatkowo z chłodzeniem wodnym procesor ma ok 30 stopni w spoczynku i nie przekracza 55 stopni pod obciążeniem przy niskim poborze prądu",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 21 May 2023",
        "review_text": "Dieser \"kleine\" Kollege is mit seinen 14 Kernen und 20 Threads der Hammer...dazu die wirklich ansprechende GPU Leistung...kann ich beruhigt empfehlen...einzig der Lüfter reicht meiner Meinung nach nich...den der junge ist gut warm unterwegs beim rechnen... was er auch darf...aber meiner hat nen noctua Lüfter bekommen und freut sich über 10 - 15 grad Abkühlung...das waren gut investierte 55€ auf lange Sicht gesehn...fanden wir beide 😉😄",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 24 August 2023",
        "review_text": "Die CPU ist preiswert und Leistung wert sehr gut hat mich bisher noch bei keinem Spiel enttäuscht und ist zu empfehlen 👍",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 15 September 2023",
        "review_text": "A questo prezzo non c'è di meglio! Processore assurdo mai riuscito a mettere sotto stress se non con benchmark, temperature sempre sotto i 60 gradi (average 47-55).",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 5 April 2023",
        "review_text": "Leider war der CPU Kühler kaputt. Ansonsten ein super teil, da ich mir sowieso einen anderen kühler einbaue stört es mich nicht. Die Lieferung war Pünktlich.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 15 November 2023",
        "review_text": "Bon dans tous ce qu'on lui demanderas et bon emballage",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 25 October 2023",
        "review_text": "SE IL PREZZO E' SUI 250 EURO....QUALITA'-PREZZO IMBATTIBILE!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 20 April 2023",
        "review_text": "Dieser Prozessor spart euch nicht nur viel Strom wegen dem mindest Leistung von 65W sondern hat auch wenn nötig eine maximal Leistung von bis zu 154W und kann damit alle Spiele problemlos starten und da ist dann kein 13600k oder 13700k geschweige denn 13900k nötig",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 29 September 2023",
        "review_text": "Un processore bestiale per 250 euro un 14 core e 20 tread fantastico",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 25 May 2023",
        "review_text": "Was gibt es groß zu sagen, jeder der den Prozessor kauft wird wissen was er damit anstellen will. Box Lüfter wird dabei sicher kaum jemand verbauen, ist eben recht laut und frickelig.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 17 February 2023",
        "review_text": "Je suis passé d'un i3-12100f à ce i5-13500 et c'est le jour et la nuit niveau performances.\nRien ne lui résiste, j'ai aussi retrouvé un framerate complètement stable et sans stuttering sur les jeux \"cpu heavy\" comme par exemple battlefield 2042.\nUn vrai régal pour le moment !\nJ'ai longtemps hésité avec le 13400f mais finalement pour une cinquantaine d'euros en plus, on a droit ici à un vrai bulldozer increvable.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 13 October 2023",
        "review_text": "Ottimo processore adatto per tutto",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 19 August 2023",
        "review_text": "Performance is good",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 15 January 2024",
        "review_text": "Cpu cooler is too small and doesn't cover the whole CPU. Not worth buying with cooler.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 15 October 2023",
        "review_text": "Non me lo aspettavo che nel 2023 da un azienda così importante come INTEL che non sia capace di fornire un dissipatore stock degno....mentre lo montavo sulla motherboard SPINGENDO IL PERNO DI MONTAGGIO DA UN LATO SI STACCAVA DALL ALTRO... ACHE SE ERA BEN ANCORATO E RUOTATO....\noltre al fatto che\nfortunatamente l altissimo ci ha salvato DA ALTRI POSSIBILI GRAVI PROBLEMI DI INSTALLAZIONE dotando i progettisti di un minimo ingegno nel porre tacche vincolate sul processore dal momento che la tacchetta del verso è MICROSCOPICA...\nAltro problema istruzioni poco chiare a disegno geroglifico..👎👎👎 speriamo che le prestazioni siano adeguate AL 2023....",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 13 October 2023",
        "review_text": "Très bien emballé conforme à la description installé et fonctionne",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 3 July 2023",
        "review_text": "Gewohnte gute Qualität - ordentliche Leistung - geringes Stromverbrauch.\nFür täglichen Bedarf eines Home-PC perfekte Lösung.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 14 April 2023",
        "review_text": "I use it in a media server. The iGPU is insane for transcoding.\nFor everything else, it is a good CPU. 70 C max with a Thermalright Assassins king 120.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 6 July 2023",
        "review_text": "Fait parfaitement le travail demandé dans un NAS avec plusieurs VM et exceptionnel dans une transcodage vidéo. Par contre prévoyez de changer le ventirad d'origine qui fait un bruit insupportable quand le CPU est en full load.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 1 April 2023",
        "review_text": "Der Prozessor hat mich beeindruckt. Sehr schnell, egal für welche Anwendung, sei es Gaming oder sonst was.\n\nFür den Preis lohnt es sich auf jeden fall, kann ich nur weiterempfehlen.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in France on 14 February 2024",
        "review_text": "Colis et emballage en parfait état MAIS\nune pale du ventilateur fourni est cassée. La seule solution est de renvoyer le tout, attendre le remboursement et commander à nouveau.\nSoit un délai supplémentaire d'au moins une semaine.\nUn geste commercial serait préférable, après le renvoi du ventilateur uniquement",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 27 March 2023",
        "review_text": "acheter pour stream et jouer sur le même pc\n\ntempérature idle: 27 degrés ingame: 55 degrés avec un Cooler Master MasterLiquid ML360 Illusion\ntrès bonne perf en 1440p avec une rtx 3070 ti tuf gaming et une MAG B760 Tomahawk WiFi DDR4\n\nje recommande .",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 25 August 2023",
        "review_text": "Bon processeur pour mon premier PC gaming,ras pour le moment, que du bonheur.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 26 July 2023",
        "review_text": "Le meilleur q/p de la 13th sur les i5 , il ne chauffe pas il est très proche du i5-13600kf .",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 24 June 2023",
        "review_text": "Pour son prix je le trouve au top. Venant d'un 10900f, j'ai un gain vraiment intéressant. Couplé avec la ddr5 6000 et une b760, c'est nickel.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 3 April 2023",
        "review_text": "Product arrived on time, seal intact, box is not damaged, processors works great, recommended!",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 28 May 2023",
        "review_text": "choisi pour remplacé mon i7-8700k veillissant, couplé a une asus rog strix b760-a gaming wifi d4, ne chauffe pas trop avec un aio corsair en 240mm",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 7 February 2023",
        "review_text": "Peu utiliser pour le moment pour en faire une analyse exaustive. Aucun problème a priori. Trés surpris par l'efficacité et le silence du petit ventirad intel fourni. Evidemment un ventirad plus conséquent sera préférable pour une utilisation plus intensive comme pour les gamers.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 20 August 2023",
        "review_text": "tres bon processeur, rapide, ne chauffe pas.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 21 March 2023",
        "review_text": "Bin beeindruckt von der Qualität und macht was er soll.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 23 July 2023",
        "review_text": "Bon CPU qui ne chauffe pas en étant très puissant.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 15 April 2023",
        "review_text": "Arrivato puntuale e montato su PC con scheda madre ASUS prime Z790-P è una bomba. Velocissimo.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 6 April 2023",
        "review_text": "Used it on my new motherboard.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 1 April 2023",
        "review_text": "Ausreichende CPU fürs Gaming.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 21 June 2023",
        "review_text": "Qualité prix imbattable.\nMatériel très puissant pour jouer sur des jeux gourmands.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 22 February 2023",
        "review_text": "Asser proche des performances du 13600k, il reste un processeur capable de tout faire. Il gère parfaitement ma rtx 3080 et rien ne lui fait peur actuellement.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 19 August 2023",
        "review_text": "Prodotto arrivato nel suo imballaggio originale totalmente distrutto.\nIl dissipatore originale è arrivato distrutto.\nNon ho provato la CPU ma vi erano dei segni di chiaro utilizzo.\nLa cpu merita davvero tanto straconsigliata dai vari recensori.\nUna delle migliori cpu rapporto qualità prezzo.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 17 April 2023",
        "review_text": "Habe ein B760 Gaming X, mein 13700K hat keine Probleme mit einer 4000 Cl16 Kit.\nDer 13500 schafft im Gear 1 nur 3000MHz RAM Takt. 3200 Startet und läuft zwar aber nach einer Woche hatte ich ein zerschossenes Windows und habe nun mit Memtest festgestellt das es bei 3200MHz ca 15 Fehler pro Stunde gibt.\n\nNicht akzeptabel.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in Italy on 10 February 2024",
        "review_text": "Il processore è ottimo ma è arrivato con la ventola rotta perché consegnato dentro sacchetto di carta.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 3 February 2023",
        "review_text": "j ai commander ce processeur a cause de ses 14 coeurs et sa faible consommation",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in France on 15 May 2023",
        "review_text": "Ràs, tourne comme une horloge.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "3.0 out of 5 stars",
        "review_date": "Reviewed in France on 6 May 2023",
        "review_text": "",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    },
    {
        "product_name": "Intel Core i5-13500 Processor, LGA 1700, 24M Cache, up to 4.80 GHz",
        "rate": "3.0 out of 5 stars",
        "review_date": "Reviewed in France on 26 January 2023",
        "review_text": "Par rapport au I5 12400F qu'il remplace, je ne vois pas de différence.",
        "product_style": "Pattern Name: Processor",
        "product_mrp": "₹31,700"
    }
]
