[
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "2.0 out of 5 stars",
        "review_date": "Reviewed in India on 25 October 2023",
        "review_text": "What's the meaning of having a new chip when it provides no generational uplift except only thing that is better than last gen is the hefty power consumption if ur fine with that this will work fine but I think ur electricity bill is gonna sky rocket 3 to 5 % uplift for 15 % more money is not worth it rather buy 13 or 12 gen with some ddr5 ram will help you more or else get r7 7700 will provide less like 10 percent for 50 percentage less power draw ryzen is just better when it comes to desktop processor in efficiency and value for money",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in India on 23 October 2023",
        "review_text": "Beast gaming world 2nd most powerful processor my set up has this processer and RTX 4070 16gb ram 2048gb(2tb) nvme m.2 ssd 850 watts pls buy it",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 8 December 2023",
        "review_text": "I was using a 10700K. I decided it was time..well, actually I got the itch.\n\nI decided to go with the 14700K for a few reasons. One is that it's the only 14th gen part from Intel that got a significant upgrade (four more e-cores and 8 more threads, plus a small clock boost).\n\nI also don't like that the 3DFX part from AMD had caused some minor issues for people, and I definitely don't like the RAM issues I see all the time on AMD systems. If it wasn't for the RAM issues, I may have gone AMD this time. Out of all the Intel systems I have assembled for customers over the years, I have not once come across a RAM issue that wasn't caused by bad RAM.\n\nThis CPU is working perfectly, and gaming excellently. Gaming benchmarks show it to be a very good CPU, and I am not having any issues with it.\n\nIf you are interested in any other Intel parts, I suggest going with 13th gen as you will basically get the same part for less money. For an i7 system though, this is an excellent CPU and a half decent upgrade over the previous gen.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 19 April 2024",
        "review_text": "7700ｋがwindows11に対応していないのでそろそろ新しいPCを組まなければと思いこちらを選びました。\n今までずっとｋ付きのi7を使ってきたので今回もそうしました。\n\n7700ｋが消費電力91ｗなのにこちらは253ｗとあり、目玉が飛び出しました。\n7700ｋは虎徹で十分に冷えましたがこちらは無理そうで、クーラーはDeepCoolのAK620を選びました。\n125ｗに電力制限をかければ70度程度に落ち着き、安心して使えそうです。グリスの塗り方を適切にすればもう少し下がりそうに思います。\n\n肝心の使用感ですが、論理コア含めて28コアもあるのでよほどの作業をしても重くならないという安心感があります。\n僕の使用状況を考えるとオーバースペックなのですが、あとになって性能が足りないと後悔するよりも、性能の高い方を買って十分なものを買ったんだと安心するほうが僕の性に合っています。\n僕がi7を買い続ける理由はこの安心感なのです。\n\n電力制限が必要なのも僕にとっては利点です。\n普段は125ｗに制限をかけておけば、いざというときに制限を解除できるという安心感につながるからです（いざというときなんてきっと来ません。分かっています）\n\n今回のi7も十分な安心感を買えたと思います。",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 8 December 2023",
        "review_text": "初自作に使用。240mm簡易水冷でそこそこに冷やせます\n私は制限125wで運用\n最新のi7を使っているだけで気分的には最高です",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 18 January 2024",
        "review_text": "Arrived earlier than expected, a very good Cpu. Expansive but what could we do.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Japan on 10 December 2023",
        "review_text": "前のCPUが４世代の4790kなので１０世代ぶりです。１４世代の中でもちょうどいい性能かな。",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Canada on 16 December 2023",
        "review_text": "Does it’s job",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 24 March 2024",
        "review_text": "vorhanden, bleibt mit ausreichend Kühlung auch im gaming Betrieb auf ca 60 Grad.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 31 May 2024",
        "review_text": "I decided the difference between the i7 and the i9 didn't justify the price difference, considering I was already getting about 1/3 more performance than my 12th generation i9. I wanted plenty of motherboard resources so I also bought the MSI MEG Z790 ACE, 32 GB of Kingston Fury 6400MT/s DDR5 and a 2TB Samsung 990 NVMe drive.\n\nCooling had been a slight issue with the 12th generation i9, even with a 360mm AIO cooler, so I went custom loop. Along the way I found a GPU water cooler on sale and decided to install a lot of cooling. The Thermaltake 900 tower can take two 560mm radiators, but I wanted some disks, so I went for a 560x140 and a 280x140, both 45mm thick and backed by 6 fans. Four more fans feed air into the case and there's till plenty of clear space for more air to be dragged in.\n\nSo what's the result? The processor runs at 85C worst case, and only two cores at that temperature. The fast DDR5 does make a significant difference. I initially ran it at 6GT/s then turned it up to 6.2 and finally 6.4. The last change is a 3.5% change in DDR5 speed and that gave me a 2.4% increase in system speed. I kept my old RTX3070 which used to run over 80C and now runs at 62C worst case. So despite more performance the system runs a lot cooler.\n\nI mostly run X-Plane 12, which runs the GPU and CPU very hard, continuously. After several hours the cooling water reached 36C and the worst core temperature was 85C. The processor just works. No stability issues with the standard settings on the MSI Z690 motherboard. There are three standard memory tuning options for 6.0, 6.2, and 6.4 GT/s and all work. This will do for me for a few years.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 13 January 2024",
        "review_text": "Nachdem ich vor einer Weile auf einen 2k 144hz Bildschirm geupgraded hab, hat mein 9600k das Bocken angefangen und konnte in letzter Zeit nicht mehr die gewünschte Leistung bringen.\n\nHab jetzt seit ein paar Tagen dieses gute Stück hier und was soll man sagen… ein Rennpferd bester Güte. High End Gaming bewältigt der 14700k Mühelos. (ein Beispiel: Forza Motorsport unter 25% auslastung laut taskmanager und laut intel monitoring unter 5% auslastung... verwirrend) Man könnte auch 2 oder 3+ Titel gleichzeitig laufen lassen wenn die Grafikkarte das mitmacht.\nMit meiner aio kühlung kann er im Stresstest schon auf 90 grad hochgehen, die ist aber schon bisschen älter, mit einer neuen lässt sich da sicher noch was machen.\nIn Spielen ca. 60-70grad.\ndie performance ist jedenfalls hervorragend\n\ndas geld hat sich jedenfalls gelohnt, allerdings ist jetzt meine 3070 wieder das bottleneck 😂👍",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 June 2024",
        "review_text": "This processor is a speed demon. Gaming, editing, encoding, and whatever else you can think of, it can handle. The performance is there. The value for money is quite good too. Unless you really want top of the line, this chip effectively eliminates the i9 from consideration. 20 cores. 8P and 12E. Boost up to 5.6GHz on 2 threads. I swapped a 12600K for this part and I'm still kinda staggered at just how fast it is in heavily threaded apps. This is a perfect upgrade chip for somebody on an older 12th gen i5 or lower. I wouldn't consider building new with it however.\n\nThere's a cost to this CPU though. Heat. And power draw. I have an Arctic Liquid Freezer III 360 AIO on this chip, and even with a sizable undervolt, it still throttles at around 230W running 100C. It feels like this chip is almost uncoolable. Unless you go full custom liquid cooling or something. I considered a large air cooler for this chip and I'm glad I went with an AIO. Buyer beware. This thing runs hot. It's also incredibly fast. If you can cool it this thing will fly.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 18 April 2024",
        "review_text": "Lot of power, enough for any game, especially if you add APO from intel but you need a good cooler because these run hot !\n\nPs: also deactivate in your BIOS the auto tunning if you have an high end motherboard… these are pumping insane volts and watts in the cpu",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 1 April 2024",
        "review_text": "La verdad es una chulada de procesador No me arrepiento de haberlo adquirido lo volveré a comprar las veces que fuese necesaria quedó genial con la computadora solo tuve que actualizar el bios de la placa base sin embargo por el resto su pan comido",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 3 May 2024",
        "review_text": "I upgraded from an 8700k to this 14700k nearly 8 years later. Performance-wise, the difference is fairly negligible to me, and that is reflected in the 'real' specs. Going from 6 cores to 20 cores isnt really a 3x+ increase when most of those cores are 'efficiency cores'. User benchmark puts 14700k as only being 47% faster than the 8700k, despite being 8 years and 6 generations apart.\n\nThe main improvement from my point of view is the reduced idle/casual power use. My UPS tells me that for my 8700k/1070ti system I drew ~0.43 Kw, and my new 14700k/4070ti super draws ~0.31 Kw watching YT, browsing the web (includes fans, monitors, etc).\n\nMostly just wanted more balance for the new graphics card, since that's what does most of the heavy lifting these days anyway. AI image generation/training - GPU, video rendering/editing/transcoding - GPU, even audio processing/correction is done on GPU these days.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 13 June 2024",
        "review_text": "Still love Intel despite their lack of anything groundbreaking recently. CPU’s still work great for gaming, this one included. Works right out the box and went perfect with my new MSI motherboard too.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 31 May 2024",
        "review_text": "I was able to get 240fps in CS go and valorant without external GPU.\nI previously had 6th gen i7 and GTX980. And that couldn't pull this.\nLightroom rendering is also good i am able to color correct 100 raw pics in seconds.\nI didn't expect this performance when i updated.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 1 May 2024",
        "review_text": "Switching from a 5800x3d for my 4080 super.. this is one heck of a cpu. I only put a $60 280mm aio \"I'd cooling\" and put it on smart fan. After that gaming has been a breeze with crazy high fps that give me 99% GPU usage in every game. Jedi survivor is getting over 130fps with dlss quality on. Which is unheard of from everything I read. Totally glad I went with this over 7800x3d. Mobo was much cheaper with every bell and whistle I wanted. My newest build is definitely nice enough to leave any builder drooling.. Thanks to this cpu at its core.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 April 2024",
        "review_text": "Upgrading from a 10700KF to 14700K. Lots of forms posts are degrading this processor but I’m here to tell you it’s well worth the money! Just make sure to go to your BIOS and limit the power to 253W. The whole heat of this chip is blown out of proportion. I haven’t gotten heat issues while gaming.\n\nOverall I have this chip paired with a 3090, while I’ll wait for a new 50 series card.\n\nSome of the gains I’ve gotten at @1440P, 45 in ultra wide 21:9, max graphics settings:\n\nOverwatch: overall 50fps gain, consistent 240hz capped out for my monitor.\nBlack Desert Online: overall 35-40 fps gains.\n\nThese are the games I normally play a lot and it’s truly notice when upgrading to this chip. Overall the computer is a snappy and fast and haven’t notice any hiccups. Really great chip and planning on keeping this for the next 4-5 years.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 8 May 2024",
        "review_text": "I'm using this as a server CPU mostly for the SR-IOV capable GPU stability has been an issue when running windows VM's on proxmox but in light of recent news about mainboard MFG's pushing the CPU too hard out of the box that may be the source of my stability issues as I mostly left the settings OOB for the CPU",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 20 May 2024",
        "review_text": "This 14th generation Intel Core i7 is a powerful and fantastic processor for a desktop gaming build.\nThe product is well packaged with some assembly instructions that are easy to follow. I heartily recommend this computer processor for DIYs and computer enthusiasts.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 12 May 2024",
        "review_text": "upgraded my pc from a 8700k to this bad boy. exceptional speeds and performance. temps are good and tasks are loading super fast !",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 24 May 2024",
        "review_text": "Works as advertised.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 6 May 2024",
        "review_text": "This Intel 14700K is phenomenal! Lightning-fast speeds and seamless performance make every task a breeze. Whether I'm gaming, streaming, or working, it handles everything with ease.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 15 May 2024",
        "review_text": "this is kinda good for my GPU",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 3 January 2024",
        "review_text": "I guess everyone is right, these things are hot and then some. I went with a off brand AIO, and for the most part I'm good. It does get spicy when I'm rendering or doing some crazy multi tasking.\n\nGaming seems fine, no issues. I play all kinds of games, FPS, MMO's, survival, etc. (Paired with a Gigabyte Gaming 4090 OC, Tforce 64 gigs 6000 M/T DDR5, samsung 990 pro NVME 2 tb x2, no OCing done by me.)\n\nI replaced a 5950x, which was having issues for some reason, just felt like it was getting slower and slower, thermal paste and heat were fine on it, never got over 60c with the beefier AIO I had on it. Just took longer and longer to render things. I guess I wore it out!\n\nI just think you'll want a good AIO, and/or a solid water cooling solution for this to really get the best out of it. I'm not sure a air cooled option will do you any good, but hey I've been wrong many times, so there might be something that can handle the job.\n\nAll in all, not bad, but it's not going to give you much performance boost over last gen, matter of fact I found out later 13700k beats it in a lot of tests, blargh! Either way, its fast, and it runs everything great, so I'm happy till the next go around.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 29 December 2023",
        "review_text": "I was never a fan of Intel's business models of locking off cores/features to try and upsell the features back to the consumer.......\n\nThat aside, Intel has always been the leader in the CPU market and while AMD has been making strides in recent years Intel is still the go to for reliability and power.\n\nAnyway.... if you have money to burn and need to upgrade due to artificial obsolesces that is the new craze of forcing people to upgrade.... well, this processor will last a long time... or until they just decide it's not capable anymore.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 31 December 2023",
        "review_text": "Very good processor, upgraded form a very nice Ryzen 1700 (6 years old with me) to this one, decided to go intel due to memory stability. After 3 weeks I can say I love it, very nice temps while gaming and I've received around a 60% improvement in my games (I maintained my RTX3070). I'm currently using a NZXT Kraken Elite 360 AIO to cool it and it has been showing around 50-60 C during high intensive gaming which is very good. Went with this over the 7800X3D since I feel this is more future proof for productivity since I upgrade every 5-6 years. While I know the AM5 socket will last longer, anyways, every time I upgrade I also upgrade the motherboard. Very nice product, will recommend it.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 17 February 2024",
        "review_text": "Greaaaaaat, but lacking in presentation.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 17 November 2023",
        "review_text": "Was going to wait until 15th gen to upgrade my 10900k but decided to go for it. While the 10900k is still a powerhouse this is a good upgrade and I am happy with. This processor is ridiculously fast and handles everything we would expect it to. Cyberpunk picked up 10fps with a 3080 but runs super smooth now at 4k with RT. I did pair this with a z790 Aorus and 32gb ddr5 6400.\n\n******** AT Own Risk******* Suggest undervolting in bios if you know what you are doing. I am running this cpu 5.7 all cores - 1.24v on a custom loop. I see idle temps 31c - gaming 60c and cinebench 89c. It will run hot if you're on air and do not adjust the default voltage. There are plenty of youtube videos out there as a resource. Overall great processor",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 28 March 2024",
        "review_text": "This new Intel® Core™ i7-14700K New Gaming Desktop Processor with 20 cores just rocks! Cooling it with an Noctua NH-U12A, Premium CPU Cooler with High-Performance Quiet NF-A12x25 PWM Fans (120mm, Brown) for Desktop.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 15 March 2024",
        "review_text": "Haven't installed yet but looks fine. Die size is 30x40 mm, meaning 0,3 ml/0,8 g is the perfect amount of thermal paste (not included). I'll put 5 dots.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 26 October 2023",
        "review_text": "I upgraded from a12700k with asus tuf z690 board and a arctic air 360 AIO. The 12700 K ran at about 50°C gaming.The 14700k runs in the mid 60s. The 12700k Cinebench score and temp was 22600/71c. The 14700k was 32000/87c . Still below throttling, which is OK according to Intel . When gaming I only see maybe five frames per second faster at 2k res .this is a good chip. Don’t get me wrong. with as many cores as this has, and the speed it should last for a long time, it far exceeds the needs of any. New or future games.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 5 December 2023",
        "review_text": "I had to replace my h60 to get this to run a full benchmark without hitting thermal limit of 100c with no OC. That is under full core usage during 30s intervals.\n\nNow that I replaced the cooler with an artic cooler with some kryonaut paste I have it running 5.6 all core with dual core at 5.7 and it maxes out at 87 on furmark",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 26 March 2024",
        "review_text": "Super easy to install. Just update your motherboard bios to support 14 Gen",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 26 March 2024",
        "review_text": "WoW! What a beast, intel i7 14700K! it can handle any tasks in pc as game and everyday use. No issues with it. Thanks for fast shipping!",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 19 February 2024",
        "review_text": "I never had a CPU on my hands before so i was really stressed out about it 😅, but i was able to mount it and it was the easiest part of my PC built, i don't have any idea about its perfomance yet and for now i just can say that in bios mode it keeps under 95°F with the AIO cooler, i will update eventualy when i finish the OS instalation",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 7 January 2024",
        "review_text": "Undervolt for best performance. Don’t get me wrong, it’s a very powerful processor. However there’s typically a lot of heat associated. Without undervolting, hitting its 100 degree Celsius cap is easier than it probably should be.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 16 January 2024",
        "review_text": "Upgrade from an I7 8700 to this. Temps are crazy when gaming but my water cooling setup helps keep it mostly stable.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Mexico on 22 March 2024",
        "review_text": "El procesador llego bien empacado y con sus condiciones y funcionalidad excelente, cumple con todo; no tiene disipador de stock, pero hay tener en cuenta que para este tipo de procesadores es necesario un disipador de calor más eficiente que los que vienen en otros procesadores",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "4.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 4 December 2023",
        "review_text": "THis is a power hungry beast of a processor..under load goes to 280 Watt easy.. had to set the power limits using intel XTU.. but idles at 30n-35 C while browsing and general use... Jumped from a I7 9700 K to this... can see huge difference in gaming else its OK !!",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 6 February 2024",
        "review_text": "They say the intel 14th gen chips run hot. If thats true then the AMD Ryzen 7 3700x's run as hot as the sun because this chip is cooler than the AMD chips.\n\nIt does draw a lot of power, but it has like 20 cores. Totally worth it.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "3.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 27 February 2024",
        "review_text": "I had tons of issues with this cpu. I returned it and purchased elsewhere due to Amazon not having a replacement option or any available at the time for prime shipping. The one that I have now works great, so it's a good product if you get one that works.\n\nMy second gripe with this cpu is that it's basically just a refresh of 13th gen without the luxury of working out of the box with z790 mobos. You will need to flash the bios of your mobo.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 14 November 2023",
        "review_text": "Built a new system with the 14700k for photo/video editing and some gaming. Decided to go with the 14th gen i7 instead of the 13th gen since it's the only series that had a noticeable improvement (4 more e cores and threads). Very fast for video editing and overkill for most gaming. Absolutely love it! I keep it cool with a 360mm AIO and a contact plate for even lower temperatures.\n\nAvg Temps:\n\n100% Load - Low 70's\n\nGaming - Mid to High 40's (Low 50's for more demading titles)\n\nIdle & Browsing - Mid 20's",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 24 January 2024",
        "review_text": "I bought it to do computations on all cores. The best value for money I could find. Requires custom loop, delliding if you want to run high boost on all cores for long periods of time. The chip is hot. I will probably drop boost clocks and undervolt to stay cool. Using Acrtic Freezer II 360.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in Germany on 17 February 2024",
        "review_text": "It makes a good pair with the RTX 4070 Ti Super, but you need a suitable cooler! With Be Quiet Dark Rock 4 Pro I manage to keep it at 60 maximum 70 degrees in games!",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 20 March 2024",
        "review_text": "It's been great so far. Clocking right and no overheating. Currently paired with a phanteks 360mm AIO.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 30 March 2024",
        "review_text": "Potente procesador para mi configuración.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 27 January 2024",
        "review_text": "Play Video\nI decided against the i9 because of cost difference. For my normal usage I use less than 2% of this CPU. But I'm really happy with the speed and performance.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 January 2024",
        "review_text": "Upgraded from a really old CPU. It was basically between the 13700k and 14700k, and for a little bit more, I thought why not just get the 14700k. If you're on a budget, then just get the 13700k. There's probably no noticeable difference. It may not be the most efficient CPU, but it just works.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 8 February 2024",
        "review_text": "I upgraded from an 11900k to this. Huge gains! Pair it with decent hardware and you got a 1440p champ.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "3.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 27 March 2024",
        "review_text": "",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 25 January 2024",
        "review_text": "just undervolt to control the temperature my work just fine with -0.080 mv",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 20 February 2024",
        "review_text": "Good!",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 17 January 2024",
        "review_text": "INTEL ES INTEL LO MEJOR DE LO MEJOR",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 3 April 2024",
        "review_text": "overall intel is great for a work station, HOWEVER the 14 series is stupid as hell... it offers NO benefit in 99.9% of situations over 13 series... I upgraded from a 12700k, and saw only minor improvements, and at the expense of power cost. My desktop now idles at 150-250 watts... before with my 12700k it was idling at like half that. in most cases a lot of people wont care, however being forced to live in a high cost of living state like CA, where electricity is $0.44 per kwh, that means just idling is costing me 0.11 per hour, that's $1000 a year just in idling... plus all the electricity my house uses. I'm only here temporarily (military) and will be moving as soon as retire, but its something to note.\n\nOn top of that, its a straight refresh of the older 13th gen, and they blocked APO for the 13th and 12th gen and aren't working on getting it working across the board (only minor useless titles no one honestly cares about)...\n\nIf it was a bit cheaper to go AMD, I would have went to a 7800x3d, but that would have cost me about 900 just to switch, due to having to buy new RAM (still on DDR4, 3600mhz/CL14) and Motherboard...\n\nThere's also the constant issue of certain games/programs just refusing to run in Multithread/Multicore, or using the E-cores inappropriately. Intel really needs to sort out this trash...",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 3 May 2024",
        "review_text": "I have written a couple of dozen reviews on Amazon and this is only my second negative review. I placed an order for a brand new Intel 14700K CPU from Amazon and it arrived as an Open Box (the factory seal had been cut and the processor was jammed into the packaging at an odd angle. I installed it in my system and it would not boot - did not even get past the POST testing. I uninstalled it and send back for a refund with a note that it was an open box and was defective.\n\nI give this only a single star across all categories as the processor arrived in an open box (I paid full price for a new CPU) and did not work in my system (it was defective on arrival) - it's a month later and I still have not received a refund. I purchased an identical CPU from another source and that CPU booted up with no issues (it is running the PC I am typing this review on) so clearly an issue with the quality of the product that Amazon shipped to me.",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 6 January 2024",
        "review_text": "Great cpu for gaming. No regrets",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "5.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 21 January 2024",
        "review_text": "Just Great",
        "product_style": null,
        "product_mrp": "₹59,100"
    },
    {
        "product_name": "Intel Core I7-14700K LGA 771 New Gaming Desktop Processor 20 Cores (8 P-Cores + 12 E-Cores) with Integrated Graphics - Unlocked",
        "rate": "1.0 out of 5 stars",
        "review_date": "Reviewed in the United States on 2 June 2024",
        "review_text": "System booted fine with 2 ram sticks installed and it appeared that everything was fine at first but after some time issues started to show up. Unfortunately this did not happen until the 30 day return policy elapsed. At first I thought it was the motherboard or RAM. But testing of different RAM ruled that out. Bios updates to the motherboard did not help the issue. Putting in a known good CPU allowed the final test of the motherboard and original system RAM and that all passed which indicates a issue with the CPU. Now I'm waiting for Intel RMA process to have them test the CPU again and hopefully replace it. When I did not have issues, it was a fast CPU, very impressed with that, just wish this showed up sooner.",
        "product_style": null,
        "product_mrp": "₹59,100"
    }
]
